andresgongora/yahal/mcu/targets/msp430f5309/wdt/wdt.cpp
// 1 TAB = 8 SPACES // LINE LENGTH = 100 CHARACTERS //

/*	+-----------------------------------------------------------------------+
	|	    Yet Another Hardware Abstraction Layer (YAHAL)		|
	|		https://github.com/andresgongora/yahal 			|
	|									|
	|									|
	| Copyright (c) 2015 - 2016, Individual contributors, see AUTHORS file.	|
	| 									|
	| This program is free software: you can redistribute it and/or modify	|
	| it under the terms of the GNU General Public License as published by	|
	| the Free Software Foundation, either version 2 of the License, or	|
	| (at your option) any later version.					|
	|									|
	| This program is distributed in the hope that it will be useful,	|
	| but WITHOUT ANY WARRANTY; without even the implied warranty of	|
	| MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the		|
	| GNU General Public License for more details.				|
	|									|
	| You should have received a copy of the GNU General Public License	|
	| along with this program.  If not, see <http://www.gnu.org/licenses/>. |
	|									|
	+-----------------------------------------------------------------------+	*/

#include "wdt.hpp"
#if YAHAL_MCU_TARGET == YAHAL_MCU_MSP430F5309

#include "../../../config/targets/msp430f5309/config.hpp"
#if YAHAL_MCU_MSP430F5309_WDT_ENABLED == true

#include "../../../config/targets/msp430f5309/wdt.hpp"

#include <msp430f5309.h>



/* ---------------------------------------------------------------------------------------------- */

yahal::mcu::targets::msp430f5309::Wdt	\
yahal::mcu::targets::msp430f5309::Wdt::instance_(yahal::mcu::targets::msp430f5309::config::wdt);

yahal::mcu::targets::msp430f5309::Wdt& yahal::mcu::targets::msp430f5309::Wdt::getInstance(void)
{
	return instance_;
}



/* ---------------------------------------------------------------------------------------------- */

yahal::mcu::targets::msp430f5309::Wdt::Wdt(const Configuration& configuration) :
	configuration_(configuration)
{}

bool yahal::mcu::targets::msp430f5309::Wdt::init(void)
{
	WDTCTL = WDTPW | WDTHOLD;	// Stop watchdog timer
	return true;
}



/* ---------------------------------------------------------------------------------------------- */

void yahal::mcu::targets::msp430f5309::Wdt::reset(void)
{
	for(;;); //TODO!
}



/* ---------------------------------------------------------------------------------------------- */
#endif // YAHAL_MCU_MSP430F5309_WDT_ENABLED == true
#endif // YAHAL_MCU_DEVICE == YAHAL_MCU_MSP430F5309
